Remove redundants docs
